{
  "version": "1.11.0",
  "compound": {
    "kind": "page",
    "id": "indexpage",
    "name": "Yosemitech Modbus",
    "url_base": "index",
    "url": "index.html",
    "include": null,
    "has_template_details": false,
    "templates": null,
    "brief": "",
    "description": "<p><a name=\"mainpage\"></a> A library to use an Arduino as a master to control and communicate with the sensors produced by <a href=\"http://en.yosemitech.com\">Yosemitech</a> via <a href=\"https://en.wikipedia.org/wiki/Modbus\">Modbus RTU</a> over <a href=\"https://en.wikipedia.org/wiki/RS-485\">RS-485</a>. This library requires the use of the <a href=\"https://github.com/EnviroDIY/SensorModbusMaster\">EnviroDIY/<wbr />SensorModbusMaster</a> library.</p><p>YosemiTech sensors only support these modbus commands:</p><ul><li>3 (0x03, Read holding registers)</li><li>16 (0x10, Write multiple registers)</li></ul><p>The communication rate is set at 9600 baud/<a href=\"https://en.wikipedia.org/wiki/8-N-1\">8-N-1</a>. The default slave ID from the factory is 0x01.</p><p>The implementation of modbus by these sensors is <em>not</em> fully compliant with the <a href=\"http://modbus.org/specs.php\">official modbus standards</a>. These are some of the irregularities we have found so far:</p><ul><li>The sensors do not act on server broadcast messages (that is, write commands sent to address 0x00).</li><li>The sensors give no response to properly formed requests for data from any registers except those few listed in the modbus manuals. (See the &quot;doc&quot; folder for copies of the manuals for the sensors we have.)</li></ul><p>Another note: The sensors seem to be somewhat.. finickey about resolving similar addresses when several are connected to the same bus. I recommend giving the sensors addresses a few numbers away from each other to help separate them on the bus. (That is, instead of numbering them as 0x01, 0x02, 0x03, 0x04, and 0x05 try 0x01, 0x03, 0x05, 0x07, and 0x09.)</p><section id=\"mainpage_hardware\"><h2>Hardware</h2><section id=\"mainpage_power\"><h3>Power Supply</h3><p>All of these sensors require a 5-12V DC power supply and the power supply can be stopped between measurements. Older sensors may require higher voltage power supplies. Do note that any time the sensor looses power, some internal configurations (such as brushing interval for sensors with wipers) will be reset to their factory values, whereas other internal configurations (such as calibration coefficiencts) are saved.. The red wire from the sensor should connect to the positive pole of the 5-12V power supply and the black to ground.</p><section id=\"mainpage_current\"><h4>Current Consumption</h4><p>The current consumption of the Yosemitech sensors is specified to be &lt;50mA, this is not accurate for their sensors which include a wiper brush, for these sensors an inductive spike exists when the brush begins to spin, which draws significantly more current than specified. Below is a table describing the current draws for several different opeating conditions of the Yosemitech 511 Turbidity senor (with brush). All tests were driven by a power supply with a 9v output</p><table class=\"m-table m-fullwidth m-flat\"><thead><tr><th>Condition</th><th>Current</th></tr></thead><tbody><tr><td>Brush Starting</td><td>&lt;290mA<sup>1</sup></td></tr><tr><td>Brush Running</td><td>52mA</td></tr><tr><td>Sensing</td><td>27mA</td></tr><tr><td>Idle</td><td>7mA</td></tr></tbody></table><p>Note <sup>1</sup>: The current on brush start can be seen in the image below, where the yellow line shows current into the sensor with a gain of 10 V/A, and the blue line is the output voltage to the sensor. The spike peak is approximately 290mA, with an exponential decay over the next 10-15ms, while this is short, it is more than enough time to brown out many low current power supplies found in data logger systems, so appropriate percautions must be taken to avoid this problem.</p><img class=\"m-image\" src=\"doc/TEK00013.PNG\" alt=\"Image\" /></section></section><section id=\"mainpage_rs485\"><h3>RS485 communication/connection</h3><p>The sensors need to communicate with the Arduino via a RS485-to-TTL adapter. The white wire of the Yosemitech sensor will connect to the &quot;B&quot; pin of the adapter and the green wire will connect to &quot;A&quot;. Note that most RS485 adapters require 3.3-5V of power and do NOT provide any power to the sensors. For adapters that require it, this library does include code to toggle the RE and DE (receive/data enable), though the timing for this is very persnickety. I recommend an adapter board with built in flow control. Also, be mindful of the logic level of the TTL output by the adapter. The MAX485, one of the most popular adapters, has a 5V logic level in the TTL signal. Up to 247 different devices can be connected in the same RS485 circuit, provided that each sensor has been separately assigned a uniques slave id.</p></section><section id=\"mainpage_ttl\"><h3>Receiving TTL Data</h3><p>If possible, always connect the RS485 adapter so the TTL signal is going to a Hardware Serial port on the Arduino. Hardware serial ports are more stable than software/pin change serial emulation. If you do not have an available hardware serial port, <a href=\"https://github.com/PaulStoffregen/AltSoftSerial\">AltSoftSerial</a> is probably the best Arduino alternative, if your board is supported. <a href=\"https://github.com/SlashDevin/NeoSWSerial\">NeoSWSerial</a> is also a decent alternative at the Yosemitech&#x27;s 9600 baud. Use the standard Arduino SoftwareSerial if nothing else is available, but be aware that some sensors may not respond correctly.</p></section></section><section id=\"mainpage_mayfly\"><h2>Suggested setup with an EnviroDIY Mayfly</h2><p>We suggest using a <a href=\"https://github.com/EnviroDIY/SensorModbusMaster/tree/master/hardware/Modbus-Mayfly_WingShield\">Modbus-Mayfly_<wbr />WingShield</a>, which combines this <a href=\"https://www.amazon.com/gp/product/B06XHH6B6R\">TTL to RS485 Adapter / 485 to Serial Port UART Level Converter Module (XY-017)</a> with a step-up boost regulator and capacitors. Plans to construct one can be found at <a href=\"https://github.com/EnviroDIY/SensorModbusMaster/tree/master/hardware/Modbus-Mayfly_WingShield\">https://github.com/EnviroDIY/SensorModbusMaster/tree/master/hardware/Modbus-Mayfly_<wbr />WingShield</a>.</p><img class=\"m-image\" src=\"https://github.com/EnviroDIY/SensorModbusMaster/blob/master/hardware/Modbus-Mayfly_WingShield/Photos/IMG_6733.JPG\" alt=\"Image\" /></section>",
    "sections": [
      [
        "mainpage_hardware",
        "Hardware",
        [
          [
            "mainpage_power",
            "Power Supply",
            [
              [
                "mainpage_current",
                "Current Consumption",
                []
              ]
            ]
          ],
          [
            "mainpage_rs485",
            "RS485 communication/connection",
            []
          ],
          [
            "mainpage_ttl",
            "Receiving TTL Data",
            []
          ]
        ]
      ],
      [
        "mainpage_mayfly",
        "Suggested setup with an EnviroDIY Mayfly",
        []
      ]
    ],
    "deprecated": null,
    "since": null,
    "example_navigation": null,
    "footer_navigation": null,
    "modules": [],
    "dirs": [],
    "files": [],
    "namespaces": [],
    "classes": [],
    "base_classes": [],
    "derived_classes": [],
    "enums": [],
    "typedefs": [],
    "funcs": [],
    "vars": [],
    "defines": [],
    "public_types": [],
    "public_static_funcs": [],
    "typeless_funcs": [],
    "public_funcs": [],
    "signals": [],
    "public_slots": [],
    "public_static_vars": [],
    "public_vars": [],
    "protected_types": [],
    "protected_static_funcs": [],
    "protected_funcs": [],
    "protected_slots": [],
    "protected_static_vars": [],
    "protected_vars": [],
    "private_funcs": [],
    "private_slots": [],
    "related": [],
    "friend_funcs": [],
    "groups": [],
    "has_enum_details": false,
    "has_typedef_details": false,
    "has_func_details": false,
    "has_var_details": false,
    "has_define_details": false,
    "breadcrumb": [
      [
        "Yosemitech Modbus",
        "index.html"
      ]
    ],
    "breadcrumbGroup": [
      [
        "Yosemitech Modbus",
        "index.html"
      ]
    ]
  }
}